package main

/*
Домашнее задание №11

В домашнем задании нужно реализовать функцию трассировки объектов.

Трассировка объектов будет осуществляться со стеков, рекурсивно проходя все объекты в куче. Важно написать
реализацию алгоритма так, чтобы не было повторных обходов одних и тех же объектов. Циклов не будет, проверку
на это реализовывать не нужно. Для обхода объектов можно использовать алгоритмы DFS или BFS.

Различать указатели и свободные участки памяти нужно будет при помощи значений в памяти, если значение непустое -
значит это указатель, который указывает на какой-то другой участок память.
*/

func Trace(stacks [][]uintptr) []uintptr {
	// need to implement
	return nil
}


